src/Catalogs/ЦеновыеСегменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЦеновыеСегменты</Name>
			<Comment>Ценовые сегменты</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Comment>Порог (%)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЦеновыеСегменты/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Ценовые сегменты"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	ЦеновойСегмент = Справочники.ЦеновыеСегменты.Низкий.ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(ЦеновойСегмент.Порог) Тогда
		ЦеновойСегмент.Порог = 25;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЦеновойСегмент.Порядок) Тогда
		ЦеновойСегмент.Порядок = 1;
	КонецЕсли;
	
	// Сохранение справочника
	НовыйЭлемент = ЦеновойСегмент.ЭтоНовый();
	Если ЦеновойСегмент.Модифицированность() Тогда
		Попытка
			ЦеновойСегмент.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Ценовые сегменты"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Создан","Обновлен"), СокрЛП(ЦеновойСегмент.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Ценовые сегменты""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	ЦеновойСегмент = Справочники.ЦеновыеСегменты.Средний.ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(ЦеновойСегмент.Порог) Тогда
		ЦеновойСегмент.Порог = 50;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЦеновойСегмент.Порядок) Тогда
		ЦеновойСегмент.Порядок = 2;
	КонецЕсли;
	
	// Сохранение справочника
	НовыйЭлемент = ЦеновойСегмент.ЭтоНовый();
	Если ЦеновойСегмент.Модифицированность() Тогда
		Попытка
			ЦеновойСегмент.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Ценовые сегменты"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Создан","Обновлен"), СокрЛП(ЦеновойСегмент.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Ценовые сегменты""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	ЦеновойСегмент = Справочники.ЦеновыеСегменты.Высокий.ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(ЦеновойСегмент.Порог) Тогда
		ЦеновойСегмент.Порог = 100;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЦеновойСегмент.Порядок) Тогда
		ЦеновойСегмент.Порядок = 3;
	КонецЕсли;
	
	// Сохранение справочника
	НовыйЭлемент = ЦеновойСегмент.ЭтоНовый();
	Если ЦеновойСегмент.Модифицированность() Тогда
		Попытка
			ЦеновойСегмент.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Ценовые сегменты"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Создан","Обновлен"), СокрЛП(ЦеновойСегмент.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Ценовые сегменты""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
